# create Pandas Series

In [1]:
import pandas as pd

In [2]:
a = pd.Series([56,78,8,10,34])

In [3]:
a

0    56
1    78
2     8
3    10
4    34
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

In [5]:
a

0    56
1    78
2     8
3    10
4    34
dtype: int64

In [5]:
print(a[0])
print(a[1])
print(a[2])
print(a[3])
print(a[4])

56
78
8
10
34

In [6]:
print(a[2:4]) # 2, 3 index series elements we can access

2     8
3    10
dtype: int64

In [9]:
print(a[1:5:3]) # 1,4
print("*********")
print(a[::2])# 0,2,4

1    78
4    34
dtype: int64
*********
0    56
2     8
4    34
dtype: int64

In [10]:
a = pd.Series(['soc','python','Java'])

In [11]:
a

0       soc
1    python
2      Java
dtype: object

In [12]:
covid_19 = pd.date_range(start = '21/3/2020' ,end = '2/9/2020')

In [16]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs) -> pandas.core.indexes.datetimes.DatetimeIndex
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : int, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    DatetimeIndex : An immutable container for datetimes.
    timedelta_range : Return a fixed frequency TimedeltaIndex.
    period_range : Return a fixed frequency PeriodIndex.
    interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [14]:
print(covid_19)

DatetimeIndex([], dtype='datetime64[ns]', freq='D')

In [25]:
covid_19 = pd.date_range(start = '21/3/2020' ,end = '22/5/2020',freq= '10D')
covid_19

DatetimeIndex(['2020-03-21', '2020-03-31', '2020-04-10', '2020-04-20',
               '2020-04-30', '2020-05-10', '2020-05-20'],
              dtype='datetime64[ns]', freq='10D')

In [22]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs)
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : integer, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    pandas.DatetimeIndex : An immutable container for datetimes.
    pandas.timedelta_range : Return a fixed frequency TimedeltaIndex.
    pandas.period_range : Return a fixed frequency PeriodIndex.
    pandas.interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [17]:
pd.date_range(start='1/1/2018', end='1/08/2018')

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

In [18]:
a = pd.date_range(start='1/1/2018', end='1/08/2018')
print(a)

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

# Pandas dataframe

In [19]:
import numpy as np

In [20]:
temp = np.random.randint(low = 20, high =100, size = [10,])
name = np.random.choice(['nabin','vamsi','parth','satish'],size=10)
random = np.random.choice([10,11,13,12,14],10)

In [21]:
random

array([12, 14, 10, 13, 12, 11, 11, 14, 12, 10])

In [22]:
name

array(['satish', 'vamsi', 'satish', 'parth', 'parth', 'satish', 'satish',
       'parth', 'parth', 'satish'], dtype='<U6')

In [23]:
temp

array([68, 37, 29, 30, 54, 43, 35, 87, 39, 86])

In [24]:
a = list(zip(temp, name, random))

In [25]:
a

[(68, 'satish', 12),
 (37, 'vamsi', 14),
 (29, 'satish', 10),
 (30, 'parth', 13),
 (54, 'parth', 12),
 (43, 'satish', 11),
 (35, 'satish', 11),
 (87, 'parth', 14),
 (39, 'parth', 12),
 (86, 'satish', 10)]

In [26]:
df = pd.DataFrame(data = a, columns=['temp','name','random'])

In [27]:
df

   temp    name  random
0    68  satish      12
1    37   vamsi      14
2    29  satish      10
3    30   parth      13
4    54   parth      12
5    43  satish      11
6    35  satish      11
7    87   parth      14
8    39   parth      12
9    86  satish      10

In [28]:
df = pd.DataFrame({'temp':temp, 'name':name, 'random':random})

In [29]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df

     name  random  temp
0  satish      10    98
1   vamsi      13    20
2   parth      13    34
3   nabin      13    21
4   nabin      14    22
5   parth      13    26
6   parth      11    55
7   parth      10    85
8   nabin      14    74
9   vamsi      13    75

In [30]:
df.head()

   temp    name  random
0    68  satish      12
1    37   vamsi      14
2    29  satish      10
3    30   parth      13
4    54   parth      12

In [31]:
df.tail()

   temp    name  random
5    43  satish      11
6    35  satish      11
7    87   parth      14
8    39   parth      12
9    86  satish      10

In [32]:
df.shape

(10, 3)

In [33]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [34]:
df.values

array([[68, 'satish', 12],
       [37, 'vamsi', 14],
       [29, 'satish', 10],
       [30, 'parth', 13],
       [54, 'parth', 12],
       [43, 'satish', 11],
       [35, 'satish', 11],
       [87, 'parth', 14],
       [39, 'parth', 12],
       [86, 'satish', 10]], dtype=object)

In [1]:
import pandas as pd
import numpy as np
temp = np.random.randint(low = 20, high =100, size = [10,])
name = np.random.choice(['nabin','vamsi','parth','satish'],size=10)
random = np.random.choice([10,11,13,12,14],10)

df = pd.DataFrame({'temp':temp, 'name':name, 'random':random})

In [2]:
df

   temp    name  random
0    96   nabin      13
1    20  satish      11
2    99   vamsi      10
3    78   parth      14
4    70   nabin      12
5    71   parth      13
6    40   parth      10
7    57   nabin      10
8    22   nabin      11
9    73   parth      11

In [3]:
# normal indexing is not support 
# it can support only slicing and dicing 
df[2:7]

   temp   name  random
2    99  vamsi      10
3    78  parth      14
4    70  nabin      12
5    71  parth      13
6    40  parth      10

In [4]:
df[2:9:3]

   temp   name  random
2    99  vamsi      10
5    71  parth      13
8    22  nabin      11

In [5]:
# access whole column data
df['random']

0    13
1    11
2    10
3    14
4    12
5    13
6    10
7    10
8    11
9    11
Name: random, dtype: int32

In [6]:
df.name

0     nabin
1    satish
2     vamsi
3     parth
4     nabin
5     parth
6     parth
7     nabin
8     nabin
9     parth
Name: name, dtype: object

In [7]:
df['name']

0     nabin
1    satish
2     vamsi
3     parth
4     nabin
5     parth
6     parth
7     nabin
8     nabin
9     parth
Name: name, dtype: object

In [8]:
df.describe()

            temp     random
count  10.000000  10.000000
mean   62.600000  11.500000
std    27.721632   1.433721
min    20.000000  10.000000
25%    44.250000  10.250000
50%    70.500000  11.000000
75%    76.750000  12.750000
max    99.000000  14.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    10 non-null     int32
 1   name    10 non-null     object
 2   random  10 non-null     int32
dtypes: int32(2), object(1)
memory usage: 288.0+ bytes

In [10]:
df

   temp    name  random
0    96   nabin      13
1    20  satish      11
2    99   vamsi      10
3    78   parth      14
4    70   nabin      12
5    71   parth      13
6    40   parth      10
7    57   nabin      10
8    22   nabin      11
9    73   parth      11

In [11]:
df.set_index('name', inplace = False)

        temp  random
name
nabin     96      13
satish    20      11
vamsi     99      10
parth     78      14
nabin     70      12
parth     71      13
parth     40      10
nabin     57      10
nabin     22      11
parth     73      11

In [12]:
df

   temp    name  random
0    96   nabin      13
1    20  satish      11
2    99   vamsi      10
3    78   parth      14
4    70   nabin      12
5    71   parth      13
6    40   parth      10
7    57   nabin      10
8    22   nabin      11
9    73   parth      11

In [13]:
df.set_index('name',inplace=True)

In [14]:
df

        temp  random
name
nabin     96      13
satish    20      11
vamsi     99      10
parth     78      14
nabin     70      12
parth     71      13
parth     40      10
nabin     57      10
nabin     22      11
parth     73      11

In [15]:
df.sort_index(axis =0, ascending=True)

        temp  random
name
nabin     96      13
nabin     70      12
nabin     57      10
nabin     22      11
parth     78      14
parth     71      13
parth     40      10
parth     73      11
satish    20      11
vamsi     99      10

In [16]:
df

        temp  random
name
nabin     96      13
satish    20      11
vamsi     99      10
parth     78      14
nabin     70      12
parth     71      13
parth     40      10
nabin     57      10
nabin     22      11
parth     73      11

In [17]:
df.sort_values(by ='random', ascending = True,inplace =True)

In [18]:
df

        temp  random
name
vamsi     99      10
parth     40      10
nabin     57      10
satish    20      11
nabin     22      11
parth     73      11
nabin     70      12
nabin     96      13
parth     71      13
parth     78      14

In [19]:
df.drop(['random'],axis =1)

        temp
name
vamsi     99
parth     40
nabin     57
satish    20
nabin     22
parth     73
nabin     70
nabin     96
parth     71
parth     78

In [20]:
df

        temp  random
name
vamsi     99      10
parth     40      10
nabin     57      10
satish    20      11
nabin     22      11
parth     73      11
nabin     70      12
nabin     96      13
parth     71      13
parth     78      14

In [21]:
df.iloc[[1,2]]

       temp  random
name
parth    40      10
nabin    57      10

In [22]:
df.iloc[:,1]

name
vamsi     10
parth     10
nabin     10
satish    11
nabin     11
parth     11
nabin     12
nabin     13
parth     13
parth     14
Name: random, dtype: int32

In [25]:
df.set_index('random',inplace=True)

In [26]:
df

        temp
random
10        99
10        40
10        57
11        20
11        22
11        73
12        70
13        96
13        71
14        78

In [27]:
df.loc[14]

temp    78
Name: 14, dtype: int32

In [28]:
df.loc[10,'temp']

random
10    99
10    40
10    57
Name: temp, dtype: int32

In [29]:
df.loc[[11,12,13]]

        temp
random
11        20
11        22
11        73
12        70
13        96
13        71

In [30]:
df.loc[12:'temp']

        temp
random
12        70
13        96
13        71
14        78

In [31]:
df.loc[df.temp > 50]

        temp
random
10        99
10        57
11        73
12        70
13        96
13        71
14        78

In [32]:
df.loc[(df.temp <70) | (df.temp > 91),:]

        temp
random
10        99
10        40
10        57
11        20
11        22
13        96

In [33]:
import pandas as pd
import warnings 
warnings.filterwarnings('ignore')

In [38]:
# Merging & concat
d1 = pd.DataFrame([['a', 1], ['b', 2],['c',4]],columns=['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']],columns=['letter', 'number', 'animal'])

In [39]:
d1

  col1  number
0    a       1
1    b       2
2    c       4

In [40]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [41]:
pd.concat([d1,d2],axis =0)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
2    c       4    NaN    NaN
0  NaN       3      c   lion
1  NaN       4      d  tiger

In [42]:
pd.concat([d1,d2], axis =0, ignore_index=True)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
2    c       4    NaN    NaN
3  NaN       3      c   lion
4  NaN       4      d  tiger

In [43]:
pd.concat([d1,d2], axis = 1)

  col1  number letter  number animal
0    a       1      c     3.0   lion
1    b       2      d     4.0  tiger
2    c       4    NaN     NaN    NaN

In [44]:
d1 = pd.DataFrame({
    "city" : ["lucknow","kanpur","agra","delhi"],
    "temperature" : [32,45,30,40]
})

In [45]:
d2 = pd.DataFrame({
    "city" : ["delhi","lucknow","kanpur"],
    "humidity" : [68,65,75]
})

In [46]:
d2

      city  humidity
0    delhi        68
1  lucknow        65
2   kanpur        75

In [47]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [12]:
df = pd.merge(d1,d2, on='city')

In [13]:
df

      city  temperature  humidity
0  lucknow           32        65
1   kanpur           45        75
2    delhi           40        68

In [48]:
pd.merge(d1,d2, on=['city'], how ='outer')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [49]:
pd.merge(d1, d2, on =['city'], how='left')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [73]:
# dataset from https://github.com/codebasics/py/blob/master/pandas/6_handling_missing_data_replace/weather_data.csv

In [2]:
import pandas as pd
df1 = pd.read_csv("weather_data.csv")

In [3]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
# pip3 install openpyxl
df1.to_excel('df_xl.xlsx', sheet_name = 'weather_data')

In [6]:
# pip3 install xlrd
df2 = pd.read_excel('df_xl.xlsx')

In [7]:
df2

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [8]:
df2.to_csv('file.csv')

In [9]:
df2.to_csv('file_noindex.csv', index = False)

In [11]:
df_group = df2.groupby("event")

In [12]:
df_group

In [13]:
for temperature in df_group:
    print(temperature)

('Rain',    Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain)
('Snow',    Unnamed: 0       day  temperature  windspeed event
2           2  1/3/2017           28          2  Snow
3           3  1/4/2017           24          7  Snow)
('Sunny',    Unnamed: 0       day  temperature  windspeed  event
1           1  1/2/2017           35          7  Sunny
5           5  1/6/2017           31          2  Sunny)

In [14]:
df_group.get_group('Rain')

   Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain

In [15]:
df_group.describe()

      Unnamed: 0                                           temperature        \
           count mean       std  min   25%  50%   75%  max       count  mean
event
Rain         2.0  2.0  2.828427  0.0  1.00  2.0  3.00  4.0         2.0  32.0
Snow         2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0         2.0  26.0
Sunny        2.0  3.0  2.828427  1.0  2.00  3.0  4.00  5.0         2.0  33.0

       ...             windspeed
       ...   75%   max     count mean       std  min   25%  50%   75%  max
event  ...
Rain   ...  32.0  32.0       2.0  5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   ...  27.0  28.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  ...  34.0  35.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

[3 rows x 24 columns]

In [30]:
def hot_temp(x):
    return x > 30

In [31]:
df2['hot_temp'] = df2['temperature'].apply(hot_temp)

In [32]:
df2

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

In [33]:
df2['hot_temp'] = df2['temperature'].apply(lambda x: x > 30)

In [34]:
df2

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

In [92]:
#pivot table

In [35]:
df2.pivot_table(values = 'temperature', index = 'event', aggfunc = 'mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [36]:
df2.pivot_table(columns = 'temperature')

temperature     24     28    31    32    35
Unnamed: 0       3      2     5     2     1
hot_temp     False  False  True  True  True
windspeed        7      2     2     5     7

In [96]:
help(pd.DataFrame.pivot_table)

Help on function pivot_table in module pandas.core.frame:

pivot_table(self, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All')
    Create a spreadsheet-style pivot table as a DataFrame. The levels in
    the pivot table will be stored in MultiIndex objects (hierarchical
    indexes) on the index and columns of the result DataFrame

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function or list of functions, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
    fill_value : scalar, default None
        Value to replace missing values with
    margins : boolean, default False
        Add all row / columns (e.g. for subtotal / grand totals)
    dropna : boolean, default True
        Do not include columns whose entries are all NaN
    margins_name : string, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
    >>> df
         A    B      C  D
    0  foo  one  small  1
    1  foo  one  large  2
    2  foo  one  large  2
    3  foo  two  small  3
    4  foo  two  small  3
    5  bar  one  large  4
    6  bar  one  small  5
    7  bar  two  small  6
    8  bar  two  large  7

    >>> table = pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    ... # doctest: +NORMALIZE_WHITESPACE
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    Returns
    -------
    table : DataFrame

    See also
    --------
    DataFrame.pivot : pivot without aggregation that can handle
        non-numeric data